app/Http/Controllers/CategoryController.php

select * from `categories` where `categories`.`shop_id` in (12)
select * from `products` where `products`.`category_id` in (40, 41, 43, 44)
select * from `shops` where `slug` = 'shop5' limit 1
select * from `categories` where `shop_id` = 12 and `slug` = 'smartfoni' limit 1
select * from `products` where `products`.`category_id` in (43)
---
    public function category(Request $request, $shopslug, $category)
    {

        $shop = Shop::where('slug', $shopslug)
            ->with('categories.products')
            ->first();


        if (!$shop) {
            return back()->with('error', 'მაღაზია არ მოიძებნა');
        }

        $categories = Category::where('shop_id', $shop->id)
            ->where('slug', $category)
            ->with('products.media')
            ->first();

select * from `shops` where `slug` = 'landingassets' limit 1
---
    public function categorySorting(Request $request, $shopslug, $category, $sorted)
    {

        $sort = explode('&', $sorted)[0];

        $shop = Shop::where('slug', $shopslug)
            ->with(['categories.products'])
            ->first();