app/Http/Controllers/HeaderNameController.php

    public function headerEdit(Request $request){

        $header=HeaderName::where('shop_id',auth()->user()->shop->id)->first();
---
select * from `header_names` where `shop_id` = 12 limit 1