app/Http/Controllers/MainController.php

    public function index(Request $request, $slug)
    {

//        return Benchmark::measure(fn () =>   $shop = Shop::where('slug', $slug)
//            ->with([
//                'user',
//                'settings',
//                'products',
//                'products.specs',
//                'products.category',
//                'categories.products.media',
//                'categories.media',
//                'mainbanner',
//                'mainbanner.media',
//                'secondbanners',
//                'thirdbanners',
//                'faqs',
//                'services',
//                'slider',
//                'socials',
//                'headername'
//            ])
//            ->first());


        $shop = Shop::where('slug', $slug)
            ->with([
                'user',
                'settings',
                'products',
                'products.specs',
                'products.category',
                'categories.products.media',
                'categories.media',
                'mainbanner',
                'mainbanner.media',
                'secondbanners',
                'thirdbanners',
                'faqs',
                'services',
                'slider',
                'socials',
                'headername'
            ])
            ->first();
---
select * from `categories` where `categories`.`id` in (40, 41, 43, 44, 46)
select * from `faqs` where `faqs`.`shop_id` in (12)
select * from `header_names` where `header_names`.`shop_id` in (12)
select * from `main_banners` where `main_banners`.`shop_id` in (12)

            return redirect()->route('index');
        }

        if (auth()->check() && request()->segment(1) !== Shop::where('user_id', auth()->user()->id)->first()->slug) {

            return redirect()->route('home', ['shop' => Shop::where('user_id', auth()->user()->id)->first()->slug]);
---
select * from `shops` where `user_id` = 18 limit 1