app/Http/Controllers/ProductController.php

select * from `categories` where `categories`.`id` in (40, 41, 43, 44, 46)
select * from `faqs` where `faqs`.`shop_id` in (12)
select * from `header_names` where `header_names`.`shop_id` in (12)
select * from `main_banners` where `main_banners`.`shop_id` in (12)
---
    public function addprductmodal(Request $request){
        $shop = Shop::where('user_id', auth()->user()->id)
            ->with([
                'user',
                'settings',
                'products',
                'products.specs',
                'products.category',
                'categories.products.media',
                'categories.media',
                'mainbanner',
                'mainbanner.media',
                'secondbanners',
                'thirdbanners',
                'faqs',
                'services',
                'slider',
                'socials',
                'headername'
            ])
            ->first();

select * from `settings` where `settings`.`shop_id` = 12 and `settings`.`shop_id` is not null
---


        // if usage of categories is turned off in settings apply default
        if (auth()->user()->shop->settings->first()->use_category == 0) {

insert into `products` (`name`, `price`, `description`, `shop_id`, `category_id`, `main_page`, `slug`, `updated_at`, `created_at`) values ('დანების ნაკრები', '15', 'უჟანგავი ფოლადის დანები', 12, '44', 1, 'danebis-nakrebi', '2024-06-23 19:21:10', '2024-06-23 19:21:10')
---
        }


        $product->save();

insert into `specs` (`product_id`, `name`, `value`, `updated_at`, `created_at`) values (545, 'რაოდენობა', '3', '2024-06-23 19:21:10', '2024-06-23 19:21:10')
---
        if ($request->has('new_spec')) {

            foreach ($validated['new_spec'] as $key => $spec) {
                $product->specs()->create([
                    'product_id' => $product->id,
                    'name'       => $spec,
                    'value'      => $validated['new_value'][$key],
                ]);

select * from `categories` where `categories`.`id` in (41, 43, 44)
select * from `faqs` where `faqs`.`shop_id` in (12)
select * from `header_names` where `header_names`.`shop_id` in (12)
select * from `main_banners` where `main_banners`.`shop_id` in (12)
---
            Storage::disk('public')->delete($filename);
        }

        $shop = Shop::where('user_id', auth()->user()->id)
            ->with([
                'user',
                'settings',
                'products',
                'products.specs',
                'products.category',
                'categories.products.media',
                'categories.media',
                'mainbanner',
                'mainbanner.media',
                'secondbanners',
                'thirdbanners',
                'faqs',
                'services',
                'slider',
                'socials',
                'headername'
            ])
            ->first();

select * from `products` where `id` = '539' limit 1
select * from `settings` where `settings`.`shop_id` in (12)
select * from `shops` where `slug` = 'shop5' limit 1
---
    public function quickView(Request $request, $shop2, $id)
    {

        $product = Product::where('id', $id)
            ->with('media')
            ->first();

        if(!$product){
            return back()->with('error', 'პროდუქტი არ მოიძებნა');

        }

        $shop = Shop::where('slug', $shop2)
            ->with('settings')
            ->first();

select * from `categories` where `categories`.`shop_id` in (12)
select * from `settings` where `settings`.`shop_id` in (12)
select * from `shops` where `user_id` = 18 limit 1
select * from `products` where `shop_id` = 12 and `id` = '555' limit 1
select * from `specs` where `specs`.`product_id` in (555)
---
    public function edit(Request $request, $shopslug, $id,$initiator)
    {


        $shop    = Shop::where('user_id', auth()->user()->id)
            ->with([

                'settings',
                'categories',
            ])
            ->first();


        $product = Product::where('shop_id', $shop->id)->where('id', $id)
            ->with('specs', 'media')
            ->first();

select * from `products` where `shop_id` = 12 and `id` = '550' limit 1
select * from `specs` where `specs`.`product_id` in (550)
select * from `categories` where `shop_id` = 12 and `name` = 'კატეგორიის გარეშე' limit 1
---
    public function updateHtmx(Request $request)
    {
        $product = Product::where('shop_id', auth()->user()->shop->id)->where('id', $request->id)
            ->with('specs', 'media')
            ->first();

        if (!$product) {
            $error='პროდუქტი არ მოიძებნა';
            return response()->view('htmx.customerror', compact('error', ))->setStatusCode(500);
        }


        $authuser          = auth()->user();
        $shopCategories    = auth()->user()->shop->categories->pluck('id')->toArray();
        $undefinedCategory=Category::where('shop_id',auth()->user()->shop->id)->where('name','კატეგორიის გარეშე')->first();

select * from `settings` where `settings`.`shop_id` = 12 and `settings`.`shop_id` is not null
---
        $product->price       = $validated['price'];
        $product->description = $validated['description'];
        $product->shop_id     = auth()->user()->shop->id;
        if (auth()->user()->shop->settings->first()->use_category === 1 && in_array($validated['category'], $shopCategories)) {

update `products` set `category_id` = '46', `products`.`updated_at` = '2024-06-23 19:35:20' where `id` = 551
---
            $product->category_id = $undefinedCategory->id;
        }

        $product->save();

update `specs` set `product_id` = 550, `name` = 'ზომა', `value` = 'M', `specs`.`updated_at` = '2024-06-23 19:29:29' where `specs`.`product_id` = 550 and `specs`.`product_id` is not null and `id` = '74'
---
        if ($request->has('old_spec')) {
            foreach ($validated['old_spec'] as $key => $spec) {
//                dd($key);
                $product->specs()->where('id', $request->old_spec_id[$key])->update([
                    'product_id' => $product->id,
                    'name'       => $spec,
                    'value'      => $validated['old_value'][$key],
                ]);

select * from `categories` where `categories`.`id` in (41, 43, 44, 46)
select * from `faqs` where `faqs`.`shop_id` in (12)
select * from `header_names` where `header_names`.`shop_id` in (12)
select * from `main_banners` where `main_banners`.`shop_id` in (12)
---



        $shop = Shop::where('user_id', auth()->user()->id)
            ->with([
                'user',
                'settings',
                'products',
                'products.specs',
                'products.category',
                'categories.products.media',
                'categories.media',
                'mainbanner',
                'mainbanner.media',
                'secondbanners',
                'thirdbanners',
                'faqs',
                'services',
                'slider',
                'socials',
                'headername'
            ])
            ->first();

select * from `products` where `shop_id` = 12 and `id` = '555' limit 1
select * from `shops` where `shops`.`user_id` = 18 and `shops`.`user_id` is not null limit 1
---
    public function imageDelete(Request $request,)
    {


        $product = Product::where('shop_id', auth()->user()->shop->id)
            ->where('id', $request->id)
            ->with('media')
            ->first();


        if (!$product) {
            $error='პროდუქტი არ მოიძებნა';
            return response()->view('htmx.customerror', compact('error', ))->setStatusCode(500);
        }


        $product->media()->where('id', $request->media_id)->delete();

select * from `shops` where `slug` = 'shop5' limit 1
select * from `products` where `shop_id` = 12 and `name` like '%მაის%'
---
    public function htmxsearch(Request $request, $shop)
    {
        if ($request->search === null) {
            return response()->noContent();
        }

        $id       = Shop::where('slug', $shop)->first();

        $products = Product::where('shop_id', $id->id)
            ->where('name', 'like', "%{$request->search}%")
            ->with('media')
            ->get();

select * from `categories` where `categories`.`shop_id` in (12)
select * from `shops` where `slug` = 'shop5' limit 1
select * from `categories` where `categories`.`id` in (41)
select * from `products` where `slug` = 'asus-rog-flow-x16' limit 1
select * from `categories` where `id` = 41 limit 1
select * from `products` where `products`.`category_id` in (41)
select count(*) as aggregate from `products` where `shop_id` = 12
---
    public function singleProduct(Request $request, $shop2, $product2)
    {

        $shop    = Shop::where('slug', $shop2)
            ->with('media')
            ->with('categories.products')
            ->first();
        $product = Product::where('slug', $product2)
            ->with('media')
            ->with('category')
            ->first();
        $productcategory=Category::where('id',$product->category_id)->with('products.media')->first();
        $productscount = Product::where('shop_id', $shop->id)->count();