app/Http/Controllers/SettingController.php

    public function update(Request $request)
    {

        $settings = auth()->user()->shop->settings->first();

        $features = [
            'use_main_banner',
            'use_main_gallery',
            'use_category',
            'use_slider',
            'use_faq',
            'use_spec',
            'use_socials',
            'use_description',
            'use_messenger',
            'show_description',
            'whatsapp',
            'use_logo'
        ];

        foreach ($features as $feature) {
            $settings->$feature = $request->has($feature) ? 1 : 0;
        }


        $settings->save();
---
select * from `settings` where `settings`.`shop_id` = 12 and `settings`.`shop_id` is not null
select * from `shops` where `shops`.`user_id` = 18 and `shops`.`user_id` is not null limit 1
update `settings` set `use_category` = 0, `settings`.`updated_at` = '2024-06-23 19:53:12' where `id` = 12