app/Http/Controllers/ShopController.php

    public function create()
    {

        if (auth()->user()->mob_confirmed === 0) {
            return redirect()->route('confirm.mobile');
        }

        if (Shop::where('user_id', auth()->user()->id)->first() !== null) {
---
select * from `shops` where `user_id` = 19 limit 1

    public function mobConfirm2(Request $request)
    {

        $user = auth()->user();
        if ($user->code == $request->code && $user->code!==null) {
            $user->mob_confirmed = 1;
            $user->save();

            if (Shop::where('user_id', auth()->user()->id)->first() === null) {
---
update `users` set `mob_confirmed` = 1, `users`.`updated_at` = '2024-06-23 17:19:18' where `id` = 19
select * from `shops` where `user_id` = 19 limit 1

    public function logoUpdate(Request $request)
    {
        $shop = Shop::where('user_id', auth()->user()->id)->first();

        if ($request->has('logoimg') && $request->logoimg != null) {

            foreach ($shop->media as $media) {
                $media->delete();
---
select * from `shops` where `user_id` = 18 limit 1
delete from `media` where `id` = 2109