app/Providers/FortifyServiceProvider.php

            public function toResponse($request)
            {


                if(auth()->user()->mob_confirmed===0){
                    return redirect()->route('confirm.mobile');
                }
                if(Shop::where('user_id',auth()->user()->id)->first()===null){
                   return redirect()->route('shop.create');
                } else{

                    $shop=auth()->user()->shop->first()->slug;
---
select * from `shops` where `user_id` = 18 limit 1
select * from `shops` where `shops`.`user_id` = 18 and `shops`.`user_id` is not null limit 1